/**
 * Группа 0 - Исходная строка
 * Группа 1 - ДатаВремя
 * Группа 2 - Первыя скобовка
 * Группа 3 - Вторая скобочка
 * Группа 4 - Номер процесса
 * Группа 5 - Тип сообщения
 * Группа 6 - Сообщение
 *
 * 15:54:16.924	[3968][6136]	9854976	INFO	Зарегистрирован обработчик RPC-протокола "SOAP"
 * 0 - 15:54:16.924	[3968][6136]	9854976	INFO	Зарегистрирован обработчик RPC-протокола "SOAP"
 * 1 - 15:54:16.924
 * 2 - 3968
 * 3 - 6136
 * 4 - 9854976
 * 5 - INFO
 * 6 - Зарегистрирован обработчик RPC-протокола "SOAP"
 * @type {RegExp}
 */
export const LoadLibMask = /(\d\d:\d\d:\d\d.\d\d\d)\s\[(\d+)]\[(\d+)]\s(\d+)\s(\S+)\s(.+)/g;

/**
 *
 * 16:01:57.319	[6280][6856]	177745920	INFO		127.0.0.1	127.0.0.1	Shift.Open	000b28b5-000b28b6-00ba-b24329ab2f89b1dc	0	9512	Конец вызова метода "СменаККМ.Создать/2". [exec_period] 18
 * 0 - 16:01:57.319	[6280][6856]	177745920	INFO		127.0.0.1	127.0.0.1	Shift.Open	000b28b5-000b28b6-00ba-b24329ab2f89b1dc	0	9512	Конец вызова метода "СменаККМ.Создать/2". [exec_period] 18
 * 1 - 15:54:16.924
 * 2 - 3968
 * 3 - 6136
 * 4 - 9854976
 * 5 - INFO
 * 6 - 127.0.0.1
 * 7 - 127.0.0.1
 * 8 - Shift.Open
 * 9 - 000b28b5-000b28b6-00ba-b24329ab2f89b1dc
 * 10 - 0
 * 11 - 9512
 * 12 - Конец вызова метода "СменаККМ.Создать/2". [exec_period] 18
 * @type {RegExp}
 */
export const ExecFuncMask = /(\d\d:\d\d:\d\d.\d\d\d)\s\[(\d+)]\[(\d+)]\s(\d+)\s(\S+)\s+(\d+.\d+.\d+.\d+)\s+(\d+.\d+.\d+.\d+)\s+(\S+)\s+(\S+)\s+(\d+)\s+(\d+)\s+(.+)/g;
